cask_args appdir: "/Applications", require_sha: true

# Taps
tap "mykolaharmash/git-jump"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"

# Base reqs
brew "git"
brew "yadm"

brew "bat"
brew "boxes"
brew "catimg"
brew "duf"
brew "editorconfig"
brew "fd"
brew "figlet"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "gron"
brew "gum"
brew "highlight"
brew "hr"
brew "htop"
brew "jq"
brew "lolcat"
brew "lsd"
brew "mas"
brew "nap"
brew "neovim"
brew "node"
brew "nvm"
brew "ots"
brew "peco"
brew "pngpaste"
brew "pwgen"
brew "shellcheck"
brew "tag"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "yadm"
brew "yarn"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mykolaharmash/git-jump/git-jump"

# brew "difftastic"
# brew "git-cal"
# brew "git-cola"
# brew "html-xml-utils"
# brew "htmlq"
# brew "mdcat"
# brew "pam-reattach"
# brew "pinentry-mac"
# brew "xdelta"
# brew "xmlstarlet"

# Casks
cask "1password"
cask "1password-cli"
cask "applite"
cask "evernote"
cask "font-cascadia-code"
cask "font-fira-code-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "obsidian"
cask "suspicious-package"

# Casks (Home)
cask "discord"
cask "mountain-duck"
cask "netnewswire"
cask "numi"

# Casks (Work)
cask "slack"
brew "slacknimate"

# MAS
mas "1Password for Safari", id: 1569813296
mas "DaisyDisk", id: 411643860
mas "Evernote Web Clipper", id: 1481669779
mas "SnippetsLab", id: 1006087419
mas "StopTheMadness Pro", id: 6471380298
mas "The Unarchiver", id: 425424353

# MAS (Home)
mas "Folder Tidy", id: 486626129
mas "Messenger", id: 1480068668
mas "PCalc", id: 403504866
mas "Shazam", id: 897118787
mas "Yubico Authenticator", id: 1497506650

# MAS (Work)
mas "Compressor", id: 424390742
