cask_args appdir: "/Applications", require_sha: true

brew "bat"
brew "boxes"
brew "editorconfig"
brew "fzf"
brew "gh"
brew "gnupg"
brew "highlight"
brew "htop"
brew "jq"
brew "mas"
brew "mdcat"
brew "neovim"
brew "node"
brew "nvm"
brew "peco"
brew "pngpaste"
brew "pwgen"
brew "slacknimate"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
# brew "xdelta"
brew "yadm"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "applite"
cask "boop"
cask "chatgpt"
cask "discord"
cask "evernote"
cask "font-cascadia-code"
cask "font-fira-code-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "mountain-duck"
cask "numi"
cask "obsidian"
cask "slack"
cask "suspicious-package"

mas "1Password for Safari", id: 1569813296
mas "Boop", id: 1518425043
# mas "Castlevania: Grimoire of Souls", id: 1552347138
mas "Compressor", id: 424390742
mas "DaisyDisk", id: 411643860
# mas "Evernote", id: 406056744
# mas "Evernote Web Clipper", id: 1481669779
mas "Folder Tidy", id: 486626129
mas "GarageBand", id: 682658836
mas "Gifox", id: 1461845568
# mas "HealthGuard", id: 1529162295
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
# mas "Kindle Classic", id: 405399194
mas "Messenger", id: 1480068668
# mas "MKV2MP4", id: 585396074
# mas "Motif", id: 1404636482
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "PayPal Honey", id: 1472777122
mas "PCalc", id: 403504866
# mas "Prime Video", id: 545519333
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
# mas "Smart Converter", id: 447513724
mas "SnippetsLab", id: 1006087419
mas "StopTheMadness Pro", id: 6471380298
mas "The Unarchiver", id: 425424353
mas "Yubico Authenticator", id: 1497506650


# vscode "dbaeumer.vscode-eslint"
# vscode "editorconfig.editorconfig"
# vscode "esbenp.prettier-vscode"
# vscode "idleberg.applescript"
# vscode "tamasfe.even-better-toml"
# vscode "visualstudioexptteam.intellicode-api-usage-examples"
# vscode "visualstudioexptteam.vscodeintellicode"